#include <iostream>
using namespace std;
int main(int argc, char* argv[])
{
	int s = 0; //Сумма цифр в билете
	int n = 0; //Счетчик подходящих чисел
	int a = 0; //Сумма цифр в произвольном числе
	int d = 0; //То же, что и а, просто второй счетчик
	int k = 0; //Счастливый билет
	cin >> s;
	for (int c = 0; c <= 999; c++)       //Вариант с тупым перебором отлично подходил для задания, где нужно просто посчитать количество
	{                                    //счастливых билетов, но вы под самый конец написали, что нужно еще и вывести сами билеты........
		d = c % 10 + (c % 100 - c % 10) / 10 + (c - c % 100) / 100; //В прошлом проекте "2020.09.20 Счаслтивые билеты" я исправил
		if ((d == s)&(c<10))                                        //код, теперь он тоже выводит сами номера билетов, но идея там 
		{                                                           //использована не моя. Тут конкретно мое решение.
			n++;                                    //Все if'ы отличаются только выводом, чтобы номера с нулями впереди выводились, как надо.
			k = c;                                  //Например, не 8008, а 008008.
			for (int b = 0; b <= 999; b++)          //Но код все равно ужасный.
			{
				a = b % 10 + (b % 100 - b % 10) / 10 + (b - b % 100) / 100;
				if ((a == s)&(b<10))
				{
					k = k * 1000 + b;
					cout << "k=00" << k << " " << "c=00" << c << " " << "b=00" << b << endl;
					k = c;
				}
				else if((a == s) & (b < 100))
				{
					k = k * 1000 + b;
					cout << "k=00" << k << " " << "c=00" << c << " " << "b=0" << b << endl;
					k = c;
				}
				else if (a == s)
				{
					k = k * 1000 + b;
					cout << "k=00" << k << " " << "c=00" << c << " " << "b=" << b << endl;
					k = c;
				}
			}
		}
		else if ((d == s) & (c < 100))
		{
			n++;
			k = c;
			for (int b = 0; b <= 999; b++)
			{
				a = b % 10 + (b % 100 - b % 10) / 10 + (b - b % 100) / 100;
				if ((a == s)&(b<10))
				{
					k = k * 1000 + b;
					cout << "k=0" << k << " " << "c=0" << c << " " << "b=00" << b << endl;
					k = c;
				}
				else if ((a == s) & (b < 100))
				{
					k = k * 1000 + b;
						cout << "k=0" << k << " " << "c=0" << c << " " << "b=0" << b << endl;
						k = c;
				}
				else if (a == s)
				{
					k = k * 1000 + b;
					cout << "k=0" << k << " " << "c=0" << c << " " << "b=" << b << endl;
					k = c;
				}
			}
		}
		else if (d == s)
		{
			n++;
				k = c;
			for (int b = 0; b <= 999; b++)
			{
				a = b % 10 + (b % 100 - b % 10) / 10 + (b - b % 100) / 100;
				if ((a == s) & (b < 10))
				{
					k = k * 1000 + b;
						cout << "k=" << k << " " << "c=" << c << " " << "b=00" << b << endl;
						k = c;
				}
				else if((a == s) & (b < 100))
				{
					k = k * 1000 + b;
					cout << "k=" << k << " " << "c=" << c << " " << "b=0" << b << endl;
					k = c;
				}
				else if (a == s)
				{
					k = k * 1000 + b;
					cout << "k=" << k << " " << "c=" << c << " " << "b=" << b << endl;
					k = c;
				}
			}
		}
	}
	cout << "n=" << n * n << endl; //Т.к. мы считали трехзначные числа, то количество счастливых билетов будет в n раз больше.
	return EXIT_SUCCESS;
}